// Мячин Валентин БАС2
#include <iostream>
#include <locale>


using namespace std;

int main() {
	setlocale(LC_ALL, "rus");


	int n;
	double
		x,
		F = 1,
		elem = 1;

	cout << "Введите Х, такое, что [0.05; 0.95]эХ:\nX = ";
	cin >> x;
	cout << "Введите количество членов последовательности n:\nn = ";
	cin >> n;

	/*
	 * Сначала считаем отдельный элемент последовательности elem
	 * Домножая elem на (x / 2i + 1)
	 * Затем прибавляем elem к F
	 */
	for (int i = 1; i < n; ++i) {
		elem *= (x / (2 * i + 1));
		F += elem;
	}

	cout << "\nF(X) = " << F << endl;

	return 0;
}
/* ------------------------------------------------I
 * Test 1:
 *
 * Введите Х, такое, что [0.05; 0.95]эХ:
 * X = 0.5
 * Введите количество членов последовательности n:
 * n = 2
 *
 * F(X) = 1.16667
 * ------------------------------------------------I
 * Test 2:
 *
 * Введите Х, такое, что [0.05; 0.95]эХ:
 * X = 0.5
 * Введите количество членов последовательности n:
 * n = 3
 *
 * F(X) = 1.18333
 * ------------------------------------------------I
 * Test 3:
 *
 * Введите Х, такое, что [0.05; 0.95]эХ:
 * X = 5
 * Введите количество членов последовательности n:
 * n = 10
 *
 * F(X) = 6.6543
 * ------------------------------------------------I
 * Test 4:
 *
 * Введите Х, такое, что [0.05; 0.95]эХ:
 * X = 0
 * Введите количество членов последовательности n:
 * n = -2
 *
 * F(X) = 1
 * ------------------------------------------------I
 */