// Мячин Валентин БАС2 вариант 9
#include <iostream>
#include <locale>


using namespace std;

int main() {
    setlocale(LC_ALL, "rus");

    double sum = 0, elem;
    int n;

    cout << "Введите количество элементов n:\nn = ";
    cin >> n;

    // Первый элемент ряда
    elem = -0.25;

    // Начинаем с i = 2 т.к. первый элемент уже есть
    // До n + 1 т.к. сумма посчитается только до n
    for (int i = 2; i <= n + 1; ++i) {
        sum += elem;
        // Рекуррентная формула
        elem *= -((double)((i - 1)*(i - 1)*(i + 2))/(i * i * (i + 3)));
    }

    cout << fixed;
    cout.precision(10);

    cout << "Сумма ряда = " << sum << endl;

    return 0;
}
/*
---------------------------------I
Test 1:

Введите количество элементов n:
n = 1
Сумма ряда = -0.2500000000
---------------------------------I
Test 2:

Введите количество элементов n:
n = 2
Сумма ряда = -0.2000000000
---------------------------------I
Test 3:

n = 0
Сумма ряда = 0.0000000000
---------------------------------I
 */
