// Мячин Валентин БАС2 вариант 9
#include <iostream>
#include <locale>


using namespace std;

int main() {
    setlocale(LC_ALL, "rus");

    int n;
    double x, elem, sum;

    cout << "Введите количество членов ряда n:\nn = ";
    cin >> n;
    cout << "Введите Х, такое, что |X| < 1\nX = ";
    cin >> x;

    elem = x;
    sum = x;


    for (int i = 2; i <= n; ++i) {
        elem *= -(x * x * (2 * i - 3)) / (2 * i - 1);
        sum += elem;
    }

    cout << "\nСумма " << n << " первых членов ряда = " << sum << endl;

    return 0;
}
/* ---------------------------------------I
 * Test 1:
 *
 * Введите количество членов ряда n:
 * n = 1
 * Введите Х, такое, что |X| < 1
 * X = 0.123456789
 *
 * Сумма 1 первых членов ряда = 0.123457
 * ---------------------------------------I
 * Test 2:
 *
 * Введите количество членов ряда n:
 * n = 3
 * Введите Х, такое, что |X| < 1
 * X = -0.9999999999999
 *
 * Сумма 3 первых членов ряда = -0.866667
 * ---------------------------------------I
 * Test 3:
 *
 * Введите количество членов ряда n:
 * n = -2
 * Введите Х, такое, что |X| < 1
 * X = 5
 *
 * Сумма -2 первых членов ряда = 5
 * ---------------------------------------I
 * Test 4:
 *
 * Введите количество членов ряда n:
 * n = 15
 * Введите Х, такое, что |X| < 1
 * X = 1
 *
 * Сумма 15 первых членов ряда = 0.802046
 * ---------------------------------------I
 */
