// Мячин Валентин БАС2
#include <locale>
#include <iostream>
#include <cmath>


int main() {

	std::setlocale(LC_ALL, "rus");

	float a, b, c, p, r, R;

	std::cout << "Введите значения сторон треугольника через пробел:" << '\n';
	std::cout << "a = ";
	std::cin >> a;
	std::cout << "b = ";
	std::cin >> b;
	std::cout << "c = ";
	std::cin >> c;

	// Считаем значения радиусов по данным формулам
	p = (a + b + c) / 2; // Полупериметр
	r = std::sqrt(((p - a) * (p - b) * (p - c) / p)); // Радиус вписанной
	R = a * b * c / (4 * std::sqrt(p * (p - a) * (p - b) * (p - c))); // Радиус описанной

	std::cout << "Радиус вписанной окружности треугольника = " << r << std::endl;
	std::cout << "Радиус описанной окружности треугольника = " << R << std::endl;

	return 0;
}
/* ---------------------------------------------------I
 * Test 1:
 * Введите значения сторон треугольника через пробел:
 * a = 3
 * b = 4
 * c = 5
 * Радиус вписанной окружности треугольника = 1
 * Радиус описанной окружности треугольника = 2.5
 * ---------------------------------------------------I
 * Test 2:
 * Введите значения сторон треугольника через пробел:
 * a = 3.1
 * b = 4.1
 * c = 5.1
 * Радиус вписанной окружности треугольника = 1.0332
 * Радиус описанной окружности треугольника = 2.55033
 * ---------------------------------------------------I
 * Test 3:
 * Введите значения сторон треугольника через пробел:
 * a = 1
 * b = 1
 * c = 2
 * Радиус вписанной окружности треугольника = 0
 * Радиус описанной окружности треугольника = inf
 * ---------------------------------------------------I
 */
