// Мячин Валентин БАС2
#include <locale>
#include <iostream>
#include <cmath>


const double pi = acos(-1);


int main() {

	std::setlocale(LC_ALL, "rus");

	double z1, z2, a;

	std::cout << "Введите значение угла a в радианах:" << '\n' << "a = ";
	std::cin >> a;

	// Подсчет значений формул (4 вариант)
	z1 = (std::sin(2 * a) + std::sin(5 * a) - std::sin(3 * a)) / (std::cos(a) + 1 - 2 * std::sin(2 * a) * std::sin(2 * a));
	z2 = (2 * std::sqrt(2) * std::cos(a) * sin(pi / 4 + 2 * a));

	std::cout << "Z1 = " << z1 << std::endl;
	std::cout << "Z2 = " << z2 << std::endl;
	
	return 0;
}
/* ---------------------------------------------------I
 * Test 1:
 * Введите значение угла a в радианах:
 * a = 0
 * Z1 = 0
 * Z2 = 2
 * ---------------------------------------------------I
 * Test 2:
 * Введите значение угла a в радианах:
 * a = 3.14159265359
 * Z1 = -5.19089e+09
 * Z2 = -2
 * ---------------------------------------------------I
 * Test 3 (pi/4):
 * Введите значение угла a в радианах:
 * a = 0.78539816339
 * Z1 = 1.41421
 * Z2 = 1.41421
 * ---------------------------------------------------I
 */
