// Мячин Валентин БАС 2 вариант 9
#include <iostream>
#include <locale>

using namespace std;

int main(){
    setlocale(LC_ALL, "rus");

    double x, y;
    bool result;

    cout << "Введите координаты х и у:\nx = ";
    cin >> x;
    cout << "y = ";
    cin >> y;

    /*
     * По условиям задачи область ограничена следующими уравнениями:
     * x > 0 y > 0 -> y<= 1-x
     * x > 0 y < 0 или x < 0 y > 0 -> x^2 + y^2 <= 1
     * x < 0 y < 0 -> y>= - 1 - x
     * x = 0 или y = 0 -> x + y <= 1
     */
    if (x > 0 && y > 0) { result = (y <= 1 - x); }
    if ((x > 0 && y < 0)||(x < 0 && y > 0)) { result = (x * x + y * y <= 1); }
    if (x < 0 && y < 0) { result =  (y >= - 1 - x); }
    if ((x == 0 || y == 0) && x + y <= 1) { result = true; }

    cout << "Значение логической переменной: " << result << '\n';
    if (result) {
        cout << "Точка с координатами ("<< x << ',' << y << ") входит в область";
    }
    if (!result) {
        cout << "Точка с координатами ("<< x << ',' << y << ") не входит в область";
    }
    return 0;
}

/* -------------------------------------------------I
 * Test 1:
 * x = 0.5
 * y = 0.5
 * Значение логической переменной: 1
 * Точка с координатами (0.5,0.5) входит в область
 * -------------------------------------------------I
 * Test 2:
 * Введите координаты х и у:
 * x = -0.7
 * y = 0.7
 * Значение логической переменной: 1
 * Точка с координатами (-0.7,0.7) входит в область
 * -------------------------------------------------I
 * Test 3:
 * Введите координаты х и у:
 * x = 0
 * y = 2
 * Значение логической переменной: 0
 * Точка с координатами (0,2) не входит в область
 * -------------------------------------------------I
 * Test 4:
 * Введите координаты х и у:
 * x = -0.3
 * y = -0.8
 * Значение логической переменной: 0
 * Точка с координатами (-0.3,-0.8) не входит в область
 * -------------------------------------------------I
 */
